---
kind: property
id: P:Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.OriginalElementTypeId
source: html/1b324b35-0617-b47c-8d05-5af63e72cd7c.htm
---
# Autodesk.Revit.DB.Events.ElementTypeDuplicatedEventArgs.OriginalElementTypeId Property

The id of the element type that is duplicated.

## Syntax (C#)
```csharp
public ElementId OriginalElementTypeId { get; }
```